

# PERCENTILE

In [1]:
import numpy as np
a=np.array([1,3,3,4,5,6,6,7,8,8])
np.percentile(a,100)

8.0

In [2]:
np.percentile(a,50)

5.5

In [3]:
np.percentile(a,10)

2.8000000000000003

In [4]:
import pandas as pd

In [5]:
data=pd.read_csv("president.csv")
data

    order                    name  height
0       1       George Washington     189
1       2              John Adams     170
2       3        Thomas Jefferson     189
3       4           James Madison     163
4       5            James Monroe     183
5       6       John Quincy Adams     171
6       7          Andrew Jackson     185
7       8        Martin Van Buren     168
8       9  William Henry Harrison     173
9      10              John Tyler     183
10     11           James K. Polk     173
11     12          Zachary Taylor     173
12     13        Millard Fillmore     175
13     14         Franklin Pierce     178
14     15          James Buchanan     183
15     16         Abraham Lincoln     193
16     17          Andrew Johnson     178
17     18        Ulysses S. Grant     173
18     19     Rutherford B. Hayes     174
19     20       James A. Garfield     183
20     21       Chester A. Arthur     183
21     23       Benjamin Harrison     168
22     25        William McKinley     170
23     26      Theodore Roosevelt     178
24     27     William Howard Taft     182
25     28          Woodrow Wilson     180
26     29       Warren G. Harding     183
27     30         Calvin Coolidge     178
28     31          Herbert Hoover     182
29     32   Franklin D. Roosevelt     188
30     33         Harry S. Truman     175
31     34    Dwight D. Eisenhower     179
32     35         John F. Kennedy     183
33     36       Lyndon B. Johnson     193
34     37           Richard Nixon     182
35     38             Gerald Ford     183
36     39            Jimmy Carter     177
37     40           Ronald Reagan     185
38     41       George H. W. Bush     188
39     42            Bill Clinton     188
40     43          George W. Bush     182
41     44            Barack Obama     185

In [6]:
heights=data['height']

In [7]:
print("Mean height:  ", heights.mean())

Mean height:   179.73809523809524

In [8]:
print("Standard deviation: ",heights.std())

Standard deviation:  7.0158688553582955

In [9]:
print("Minimum height: ",heights.var())

Minimum height:  49.22241579558652

In [10]:
print("Maximum height: ",heights.max())

Maximum height:  193

In [11]:
heights.plot.bar()

In [12]:
df=pd.read_csv("student.csv")
df

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [13]:
df['Maths'].mean()

59.6

In [14]:
df['English'].mean()

69.7

In [15]:
df['Maths'].mode()

0    55
dtype: int64

In [16]:
df.describe()

,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.0000
mean,59.600000,72.300000,75.300000,69.700000,64.700000,72.700000,69.700000,60.5000
std,19.460501,20.661559,14.000397,14.453373,26.998148,14.629119,14.453373,25.3432
min,25.000000,45.000000,52.000000,46.000000,21.000000,52.000000,46.000000,2.0000
25%,54.250000,56.250000,65.000000,59.250000,54.250000,58.750000,59.250000,52.2500
50%,55.000000,70.000000,78.000000,69.500000,66.500000,76.000000,69.500000,63.0000
75%,70.750000,93.750000,86.750000,81.250000,87.000000,86.000000,81.250000,76.2500
max,96.000000,96.000000,89.000000,89.000000,96.000000,89.000000,89.000000,89.0000

In [17]:
df['Maths'].median()

55.0

PERCENTILE AND SPREAD OF DATA

In [18]:
import scipy
from scipy import stats
from scipy.stats import percentileofscore

In [19]:
df=pd.read_csv('student.csv')
df

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [20]:
percentileofscore(df['Maths'],25)

10.0

In [21]:
percentileofscore(df['Maths'],75)

80.0

In [22]:
max_m=df['Maths'].max()

In [23]:
max_m

96

In [24]:
min_m=df['Maths'].min()

In [25]:
min_m

25

In [26]:
r=max_m-min_m
r

71

Spread of data

Q1Q2Q3

IQR -INTERQUARTILE Q3-Q1

In [27]:
q1=df['Maths'].quantile(0.25)
q1

54.25

In [28]:
q3=df['Maths'].quantile(0.75)
q3

70.75

In [29]:
IQR=q3-q1
IQR

16.5

In [30]:
df['Maths'].var()

378.71111111111105

In [31]:
df['Maths'].std()

19.46050130677807

# 6 TH OCTOBER

In [32]:
from scipy.stats import zscore

In [33]:
zscore([56,34,21,33])

array([ 1.58361516, -0.15836152, -1.18771137, -0.23754227])

In [34]:
df.iloc[:,3:-1]

   Maths  Physics  Chemistry  English  Biology  Economics  History
0     55       45         56       87       21         52       89
1     75       96         78       64       90         61       58
2     25       54         89       76       95         87       56
3     78       96         86       63       54         89       75
4     58       96         78       46       96         77       83
5     45       87         52       89       55         89       87
6     55       64         61       58       75         58       64
7     54       76         87       56       25         56       76
8     55       63         89       75       78         75       63
9     96       46         77       83       58         83       46

In [35]:
df['Maths'].mean()

59.6